tutorials/heatTransfer/buoyantPimpleFoam/hotRoomWithThermalShell/constant/faMesh/faMeshDefinition
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/faMesh";
    object      faMeshDefinition;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

polyMeshPatches  1(ceiling);

boundary
{
    side1
    {
        type                patch;
        ownerPolyPatch      ceiling;
        neighbourPolyPatch  fixedWall1;
    }

    side2
    {
        type                patch;
        ownerPolyPatch      ceiling;
        neighbourPolyPatch  fixedWall2;
    }

     side3
    {
        type                patch;
        ownerPolyPatch      ceiling;
        neighbourPolyPatch  fixedWall3;
    }

    side4
    {
        type                patch;
        ownerPolyPatch      ceiling;
        neighbourPolyPatch  fixedWall4;
    }
}


// ************************************************************************** //
